{
  "pdf": "/Users/William/Documents/TEMP/Python/yfp-credit-evaluation/.samples/Draft - CE - Sparkle and Glow Beauty Innovations Corp.pdf",
  "notes": {
    "REQUEST": [
      {
        "page": 1,
        "excerpt": "YULON FINANCE PHILIPPINES CORPORATION CREDIT EVALUATION REPORT – CORPORATE FINANCE & LEASING Medical Equipment I. REQUEST Name of Borrower : Sparkle and Glow Beauty Innovations Corp. Source of Account : BDO – E. Ching Credit Accommodation : Credit Line via Finance Lease and Medium-term Loan Availment No. : 1st Asset Type : Aesthetic/Medical Equipment Brand : BTL, Tritan Ventures Inc. Condition : Brand New Sales Proposal Credit Recommendation Credit Limit P30,000,000.00 P10,000,000.00 Leasing Medium-Term Loan Leasing Medium-Term Loan Sub-limit amount 20,000,000 10,000,000 10,000,000 Terms 36 mos 24 mos 36 mos Monthly Payment P713,055 P494,423 P356,528 N/A Effective Yield (EY) 17% 17% 17% IRR 17% 18.04% 18.07% AOR 28.35% 18.66% 28.35% Mode of Payment : Post Dated Checks Purpose of the Loan :"
      },
      {
        "page": 3,
        "excerpt": "YULON FINANCE PHILIPPINES CORPORATION CREDIT EVALUATION REPORT – CORPORATE FINANCE & LEASING Medical Equipment Residing at 105 JN Gonzales Puerto Rivas Itaas City of Balanga Bataan. List of personal assets of Camille Padilla Items Amount (P000s) Real Estate Properties - Vehicles 2021 Nissan Navarra 848 2020 Mercedes GLC 200 3,690 Vespa Sean Wotherspoon 259 Total personal assets 4,797 Less: Personal liabilities *7,634 Personal assets, net of personal liabilities -2,837 Less: Total facilities of Sparkle and Glow, including proposed PHP30M AF 33,241 PERSONAL ASSETS, NET OF SPARKLE AND GLOW’S LOANS -36,078 * Represents borrowing from an individual as disclosed by the client. This is non-interest-bearing borrowings from her former significant other. ** No submitted list of assets for Krishia Di"
      },
      {
        "page": 5,
        "excerpt": "YULON FINANCE PHILIPPINES CORPORATION CREDIT EVALUATION REPORT – CORPORATE FINANCE & LEASING Medical Equipment Provision for Income Tax 597 5.89% 2,403 8.79% 2,884 7.04% Net Income (Loss) 1,393 13.74% 7,209 26.38% 11,534 28.15% RATIOS/COVERAGE 2021 2022 2023 Sales Growth (%) 169.54 49.91 Net Income Growth (%) 417.54 60.01 Gross Profit Margin (%) 67.62 72.92 65.95 Operating Margin (%) 19.62 35.17 35.19 Net Income Margin (%) 13.74 26.38 28.15 ROE (%) -114.63 120.27 65.81 Days Receivables 8 0 0 Days Inventory 904 382 90 Days Payables 519 405 350 Funding Gap 393 -24 -260 Net Working Capital 4,256 1,553 -5,483 Working Capital Requirement 3,532 -481 -9,947 Current Ratio(x) 1.91 1.19 0.59 Quick Ratio(x) 0.11 0.16 0.18 Sales/ Net Working Capital 2.38 17.60 -7.47 D/E Ratio (x) -40.51 7.49 2.33 Gros"
      },
      {
        "page": 9,
        "excerpt": "YULON FINANCE PHILIPPINES CORPORATION CREDIT EVALUATION REPORT – CORPORATE FINANCE & LEASING Medical Equipment P age 9"
      }
    ],
    "SALES_RECOMMENDATION": [
      {
        "page": 2,
        "excerpt": "YULON FINANCE PHILIPPINES CORPORATION CREDIT EVALUATION REPORT – CORPORATE FINANCE & LEASING Medical Equipment e) Subject leased asset shall be covered by Electronic Equipment Insurance “EEI” with YFP as Assured Party or Loss Payee f) Payment of Notarial fee amounting to Php3,000 Medium-Term Loan a) Copy of Quotation or Invoice from Original Supplier b) Promissory Note with Addendum c) Signed Sale and Purchase with Instalment Agreement d) Payment of Upfront Fee (1% of AF based on actual per availment) II. SALES RECOMMENDATION 1. With solid 6-year experience in operation. 2. Significant upward trend of Net Income from 2021 to 2023 (from 2022-2023 In House FS). 3. A consistent revenue stream ranging from 3.3M to 7.3M based on the 2024 Service Income. 4. Strong relationship with major aesthet"
      }
    ],
    "BACKGROUND": [],
    "FINANCIAL_PERFORMANCE": [
      {
        "page": 4,
        "excerpt": "YULON FINANCE PHILIPPINES CORPORATION CREDIT EVALUATION REPORT – CORPORATE FINANCE & LEASING Medical Equipment c. BANK CHECKING Bank Name Type of Account OB and ADB Date Opened Experience BDO CA OB: 6 DIGITS SEPT. 21, 2018 NO HISTORY OF ROCKWELL CENTER - MAKATI 004908027727 ADB: 6 DIGITS BOUNCED CHECK DIANNE **AS OF 03/27/2025 77298816 bh.rockwellcenter- makati@bdo.com.ph BDO CA OB: 6 DIGITS MAY 20, 2018 NO HISTORY OF ROCKWELL CENTER 004908027646 ADB: 6 DIGITS BOUNCED CHECK DIANNE BACANI/SERVICE **AS OF 03/27/2025 OFFICER 77298816 bh.rockwellcenter- makati@bdo.com.ph BPI CA ADB: 42,748.69 06/13/2019 CONFIRMED ACTIVE 38TH ST BGC 9031001185 (03/27/2025) HANDLING NOT OB: NOT ALLOWED BY THE ALLOWED BY THE CLIENT ROB ROSARIO SPARKLE AND CLIENT ABM GLOW BEAUTY 88432202 INNOVATIONS 09177991747 CO"
      }
    ],
    "RISKS_MITIGANTS": [
      {
        "page": 6,
        "excerpt": "YULON FINANCE PHILIPPINES CORPORATION CREDIT EVALUATION REPORT – CORPORATE FINANCE & LEASING Medical Equipment - Other Current Assets represents Input VAT while Other Assets represent Deferred Tax Asset. - Advances from Shareholders came from the company’s Chairman, President, and CEO Camille Padilla. This is a non-interest-bearing advances with no definite call date and was made to support the company’s operations during the pandemic. However, this is being slowly paid by the corporation demonstrated by lower balance of PHP27.45M as of 12/31/2023 from PHP44.56M as of 12/31/2021. Cashflow (brief explanation on the major movements) - Company generated a better EBITDA of PHP17.28M (2022: PHP11.91M) driven by the topline growth. - No recorded debt servicing requirements in 2021-2023 as the lo"
      }
    ],
    "RECOMMENDATION": [],
    "SIGN_OFF": [
      {
        "page": 7,
        "excerpt": "YULON FINANCE PHILIPPINES CORPORATION CREDIT EVALUATION REPORT – CORPORATE FINANCE & LEASING Medical Equipment c. Weak JSS of sureties and no defined succession plan in place - As disclosed and estimated, personal assets of proposed surety, Camille Padilla, is PHP4.80M. This is lower than the PHP7.63M personal liabilities and PHP3.24M existing loans being guaranteed. Proposed PHP30M loan will further weaken the quality of JSS as the proposed surety already have negative net worth. - Further, her child is still a minor. Nonetheless, Ms. Padilla is still young (38 y/o) and reportedly healthy. - Although having weak JSS, the family of surety has other business engaged in the construction business. - No submitted list of assets for the other surety, Krishia Dizon d. Overstocking of inventories"
      }
    ],
    "APPENDIX_A": [],
    "APPENDIX_B": [
      {
        "page": 8,
        "excerpt": "YULON FINANCE PHILIPPINES CORPORATION CREDIT EVALUATION REPORT – CORPORATE FINANCE & LEASING Medical Equipment A. Credit Grading Parameter B. Client Visit Pictures, if any P age 8 NYTCF BHYYCCC In B SCT FTCSOCDInT YPS T C T a m e o f B o r r o w e r e a r o f F in a n c ia l S ta te m e n t U s e y p e o f F in a n c ia l S ta te m e n t U s e R E D IT R A T IN G IN A L S C O R E M A N A G E M E N T A N D O P E R A T IO u s in e s s T y p e o s p ita l L e v e l e a r o f M a n a g e m e n t E x p e rie n c e e a r o f B u s in e s s o m p a n y p ro p e rty s ta tu s (s ite v is it re q re d it R e c o rd o u rt C a s e s d u s try O u tlo o k a n k R e fe re n c e C h e c k R e s u lt u p p lie r R e fe re n c e C h e c k R e s u lt u s to m e r R e fe re n c e C h e c k R e s u lt o ta "
      }
    ]
  }
}